susanw1/zscript/receivers/native/arm/implementations/src/main/c++/stm32/AlternateFunction/STM32L45x.h
/*
 * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
 * Timestamp: 2022-12-19T23:52:17.252953
 */

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define CAN1_RX_PA11_ PA11,GPIO_AF9
#define CAN1_RX_PB12_ PB12,GPIO_AF10
#define CAN1_RX_PB5_ PB5,GPIO_AF3
#define CAN1_RX_PB8_ PB8,GPIO_AF9
#define CAN1_RX_PD0_ PD0,GPIO_AF9
#define _CAN1_RX_PA11_ 1
#define _CAN1_RX_PB12_ 1
#define _CAN1_RX_PB5_ 1
#define _CAN1_RX_PB8_ 1
#define _CAN1_RX_PD0_ 1

#define CAN1_TX_PA12_ PA12,GPIO_AF9
#define CAN1_TX_PB13_ PB13,GPIO_AF10
#define CAN1_TX_PB6_ PB6,GPIO_AF8
#define CAN1_TX_PB9_ PB9,GPIO_AF9
#define CAN1_TX_PD1_ PD1,GPIO_AF9
#define _CAN1_TX_PA12_ 1
#define _CAN1_TX_PB13_ 1
#define _CAN1_TX_PB6_ 1
#define _CAN1_TX_PB9_ 1
#define _CAN1_TX_PD1_ 1

#define COMP1_OUT_PA0_ PA0,GPIO_AF12
#define COMP1_OUT_PA11_ PA11,GPIO_AF6
#define COMP1_OUT_PA6_ PA6,GPIO_AF6
#define COMP1_OUT_PB0_ PB0,GPIO_AF12
#define COMP1_OUT_PB10_ PB10,GPIO_AF12
#define _COMP1_OUT_PA0_ 1
#define _COMP1_OUT_PA11_ 1
#define _COMP1_OUT_PA6_ 1
#define _COMP1_OUT_PB0_ 1
#define _COMP1_OUT_PB10_ 1

#define COMP2_OUT_PA2_ PA2,GPIO_AF12
#define COMP2_OUT_PA7_ PA7,GPIO_AF12
#define COMP2_OUT_PB11_ PB11,GPIO_AF12
#define COMP2_OUT_PB5_ PB5,GPIO_AF12
#define _COMP2_OUT_PA2_ 1
#define _COMP2_OUT_PA7_ 1
#define _COMP2_OUT_PB11_ 1
#define _COMP2_OUT_PB5_ 1

#define CRS_SYNC_PA10_ PA10,GPIO_AF10
#define _CRS_SYNC_PA10_ 1

#define DFSDM1_CKIN0_PB0_ PB0,GPIO_AF6
#define DFSDM1_CKIN0_PB2_ PB2,GPIO_AF6
#define DFSDM1_CKIN0_PD4_ PD4,GPIO_AF6
#define _DFSDM1_CKIN0_PB0_ 1
#define _DFSDM1_CKIN0_PB2_ 1
#define _DFSDM1_CKIN0_PD4_ 1

#define DFSDM1_CKIN1_PA8_ PA8,GPIO_AF6
#define DFSDM1_CKIN1_PB13_ PB13,GPIO_AF6
#define DFSDM1_CKIN1_PD7_ PD7,GPIO_AF6
#define _DFSDM1_CKIN1_PA8_ 1
#define _DFSDM1_CKIN1_PB13_ 1
#define _DFSDM1_CKIN1_PD7_ 1

#define DFSDM1_CKIN2_PB15_ PB15,GPIO_AF6
#define DFSDM1_CKIN2_PE8_ PE8,GPIO_AF6
#define _DFSDM1_CKIN2_PB15_ 1
#define _DFSDM1_CKIN2_PE8_ 1

#define DFSDM1_CKIN3_PC6_ PC6,GPIO_AF6
#define DFSDM1_CKIN3_PE5_ PE5,GPIO_AF6
#define _DFSDM1_CKIN3_PC6_ 1
#define _DFSDM1_CKIN3_PE5_ 1

#define DFSDM1_CKOUT_PA5_ PA5,GPIO_AF6
#define DFSDM1_CKOUT_PC2_ PC2,GPIO_AF6
#define DFSDM1_CKOUT_PE9_ PE9,GPIO_AF6
#define _DFSDM1_CKOUT_PA5_ 1
#define _DFSDM1_CKOUT_PC2_ 1
#define _DFSDM1_CKOUT_PE9_ 1

#define DFSDM1_DATIN0_PA7_ PA7,GPIO_AF6
#define DFSDM1_DATIN0_PB1_ PB1,GPIO_AF6
#define DFSDM1_DATIN0_PD3_ PD3,GPIO_AF6
#define _DFSDM1_DATIN0_PA7_ 1
#define _DFSDM1_DATIN0_PB1_ 1
#define _DFSDM1_DATIN0_PD3_ 1

#define DFSDM1_DATIN1_PA9_ PA9,GPIO_AF6
#define DFSDM1_DATIN1_PB12_ PB12,GPIO_AF6
#define DFSDM1_DATIN1_PD6_ PD6,GPIO_AF6
#define _DFSDM1_DATIN1_PA9_ 1
#define _DFSDM1_DATIN1_PB12_ 1
#define _DFSDM1_DATIN1_PD6_ 1

#define DFSDM1_DATIN2_PB14_ PB14,GPIO_AF6
#define DFSDM1_DATIN2_PE7_ PE7,GPIO_AF6
#define _DFSDM1_DATIN2_PB14_ 1
#define _DFSDM1_DATIN2_PE7_ 1

#define DFSDM1_DATIN3_PC7_ PC7,GPIO_AF6
#define DFSDM1_DATIN3_PE4_ PE4,GPIO_AF6
#define _DFSDM1_DATIN3_PC7_ 1
#define _DFSDM1_DATIN3_PE4_ 1

#define EVENTOUT_PA0_ PA0,GPIO_AF15
#define EVENTOUT_PA1_ PA1,GPIO_AF15
#define EVENTOUT_PA10_ PA10,GPIO_AF15
#define EVENTOUT_PA11_ PA11,GPIO_AF15
#define EVENTOUT_PA12_ PA12,GPIO_AF15
#define EVENTOUT_PA13 (JTMS/SWDIO)_ PA13 (JTMS/SWDIO),GPIO_AF15
#define EVENTOUT_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF15
#define EVENTOUT_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF15
#define EVENTOUT_PA2_ PA2,GPIO_AF15
#define EVENTOUT_PA3_ PA3,GPIO_AF15
#define EVENTOUT_PA4_ PA4,GPIO_AF15
#define EVENTOUT_PA5_ PA5,GPIO_AF15
#define EVENTOUT_PA6_ PA6,GPIO_AF15
#define EVENTOUT_PA7_ PA7,GPIO_AF15
#define EVENTOUT_PA8_ PA8,GPIO_AF15
#define EVENTOUT_PA9_ PA9,GPIO_AF15
#define EVENTOUT_PB0_ PB0,GPIO_AF15
#define EVENTOUT_PB1_ PB1,GPIO_AF15
#define EVENTOUT_PB10_ PB10,GPIO_AF15
#define EVENTOUT_PB11_ PB11,GPIO_AF15
#define EVENTOUT_PB12_ PB12,GPIO_AF15
#define EVENTOUT_PB13_ PB13,GPIO_AF15
#define EVENTOUT_PB14_ PB14,GPIO_AF15
#define EVENTOUT_PB15_ PB15,GPIO_AF15
#define EVENTOUT_PB2_ PB2,GPIO_AF15
#define EVENTOUT_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF15
#define EVENTOUT_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF15
#define EVENTOUT_PB5_ PB5,GPIO_AF15
#define EVENTOUT_PB6_ PB6,GPIO_AF15
#define EVENTOUT_PB7_ PB7,GPIO_AF15
#define EVENTOUT_PB8_ PB8,GPIO_AF15
#define EVENTOUT_PB9_ PB9,GPIO_AF15
#define EVENTOUT_PC0_ PC0,GPIO_AF15
#define EVENTOUT_PC1_ PC1,GPIO_AF15
#define EVENTOUT_PC10_ PC10,GPIO_AF15
#define EVENTOUT_PC11_ PC11,GPIO_AF15
#define EVENTOUT_PC12_ PC12,GPIO_AF15
#define EVENTOUT_PC13_ PC13,GPIO_AF15
#define EVENTOUT_PC14_ PC14,GPIO_AF15
#define EVENTOUT_PC15_ PC15,GPIO_AF15
#define EVENTOUT_PC2_ PC2,GPIO_AF15
#define EVENTOUT_PC3_ PC3,GPIO_AF15
#define EVENTOUT_PC4_ PC4,GPIO_AF15
#define EVENTOUT_PC5_ PC5,GPIO_AF15
#define EVENTOUT_PC6_ PC6,GPIO_AF15
#define EVENTOUT_PC7_ PC7,GPIO_AF15
#define EVENTOUT_PC8_ PC8,GPIO_AF15
#define EVENTOUT_PC9_ PC9,GPIO_AF15
#define EVENTOUT_PD0_ PD0,GPIO_AF15
#define EVENTOUT_PD1_ PD1,GPIO_AF15
#define EVENTOUT_PD10_ PD10,GPIO_AF15
#define EVENTOUT_PD11_ PD11,GPIO_AF15
#define EVENTOUT_PD12_ PD12,GPIO_AF15
#define EVENTOUT_PD13_ PD13,GPIO_AF15
#define EVENTOUT_PD14_ PD14,GPIO_AF15
#define EVENTOUT_PD15_ PD15,GPIO_AF15
#define EVENTOUT_PD2_ PD2,GPIO_AF15
#define EVENTOUT_PD3_ PD3,GPIO_AF15
#define EVENTOUT_PD4_ PD4,GPIO_AF15
#define EVENTOUT_PD5_ PD5,GPIO_AF15
#define EVENTOUT_PD6_ PD6,GPIO_AF15
#define EVENTOUT_PD7_ PD7,GPIO_AF15
#define EVENTOUT_PD8_ PD8,GPIO_AF15
#define EVENTOUT_PD9_ PD9,GPIO_AF15
#define EVENTOUT_PE0_ PE0,GPIO_AF15
#define EVENTOUT_PE1_ PE1,GPIO_AF15
#define EVENTOUT_PE10_ PE10,GPIO_AF15
#define EVENTOUT_PE11_ PE11,GPIO_AF15
#define EVENTOUT_PE12_ PE12,GPIO_AF15
#define EVENTOUT_PE13_ PE13,GPIO_AF15
#define EVENTOUT_PE14_ PE14,GPIO_AF15
#define EVENTOUT_PE15_ PE15,GPIO_AF15
#define EVENTOUT_PE2_ PE2,GPIO_AF15
#define EVENTOUT_PE3_ PE3,GPIO_AF15
#define EVENTOUT_PE4_ PE4,GPIO_AF15
#define EVENTOUT_PE5_ PE5,GPIO_AF15
#define EVENTOUT_PE6_ PE6,GPIO_AF15
#define EVENTOUT_PE7_ PE7,GPIO_AF15
#define EVENTOUT_PE8_ PE8,GPIO_AF15
#define EVENTOUT_PE9_ PE9,GPIO_AF15
#define EVENTOUT_PH0_ PH0,GPIO_AF15
#define EVENTOUT_PH1_ PH1,GPIO_AF15
#define EVENTOUT_PH3_ PH3,GPIO_AF15
#define _EVENTOUT_PA0_ 1
#define _EVENTOUT_PA1_ 1
#define _EVENTOUT_PA10_ 1
#define _EVENTOUT_PA11_ 1
#define _EVENTOUT_PA12_ 1
#define _EVENTOUT_PA13 (JTMS/SWDIO)_ 1
#define _EVENTOUT_PA14 (JTCK/SWCLK)_ 1
#define _EVENTOUT_PA15 (JTDI)_ 1
#define _EVENTOUT_PA2_ 1
#define _EVENTOUT_PA3_ 1
#define _EVENTOUT_PA4_ 1
#define _EVENTOUT_PA5_ 1
#define _EVENTOUT_PA6_ 1
#define _EVENTOUT_PA7_ 1
#define _EVENTOUT_PA8_ 1
#define _EVENTOUT_PA9_ 1
#define _EVENTOUT_PB0_ 1
#define _EVENTOUT_PB1_ 1
#define _EVENTOUT_PB10_ 1
#define _EVENTOUT_PB11_ 1
#define _EVENTOUT_PB12_ 1
#define _EVENTOUT_PB13_ 1
#define _EVENTOUT_PB14_ 1
#define _EVENTOUT_PB15_ 1
#define _EVENTOUT_PB2_ 1
#define _EVENTOUT_PB3 (JTDO/TRACESWO)_ 1
#define _EVENTOUT_PB4 (NJTRST)_ 1
#define _EVENTOUT_PB5_ 1
#define _EVENTOUT_PB6_ 1
#define _EVENTOUT_PB7_ 1
#define _EVENTOUT_PB8_ 1
#define _EVENTOUT_PB9_ 1
#define _EVENTOUT_PC0_ 1
#define _EVENTOUT_PC1_ 1
#define _EVENTOUT_PC10_ 1
#define _EVENTOUT_PC11_ 1
#define _EVENTOUT_PC12_ 1
#define _EVENTOUT_PC13_ 1
#define _EVENTOUT_PC14_ 1
#define _EVENTOUT_PC15_ 1
#define _EVENTOUT_PC2_ 1
#define _EVENTOUT_PC3_ 1
#define _EVENTOUT_PC4_ 1
#define _EVENTOUT_PC5_ 1
#define _EVENTOUT_PC6_ 1
#define _EVENTOUT_PC7_ 1
#define _EVENTOUT_PC8_ 1
#define _EVENTOUT_PC9_ 1
#define _EVENTOUT_PD0_ 1
#define _EVENTOUT_PD1_ 1
#define _EVENTOUT_PD10_ 1
#define _EVENTOUT_PD11_ 1
#define _EVENTOUT_PD12_ 1
#define _EVENTOUT_PD13_ 1
#define _EVENTOUT_PD14_ 1
#define _EVENTOUT_PD15_ 1
#define _EVENTOUT_PD2_ 1
#define _EVENTOUT_PD3_ 1
#define _EVENTOUT_PD4_ 1
#define _EVENTOUT_PD5_ 1
#define _EVENTOUT_PD6_ 1
#define _EVENTOUT_PD7_ 1
#define _EVENTOUT_PD8_ 1
#define _EVENTOUT_PD9_ 1
#define _EVENTOUT_PE0_ 1
#define _EVENTOUT_PE1_ 1
#define _EVENTOUT_PE10_ 1
#define _EVENTOUT_PE11_ 1
#define _EVENTOUT_PE12_ 1
#define _EVENTOUT_PE13_ 1
#define _EVENTOUT_PE14_ 1
#define _EVENTOUT_PE15_ 1
#define _EVENTOUT_PE2_ 1
#define _EVENTOUT_PE3_ 1
#define _EVENTOUT_PE4_ 1
#define _EVENTOUT_PE5_ 1
#define _EVENTOUT_PE6_ 1
#define _EVENTOUT_PE7_ 1
#define _EVENTOUT_PE8_ 1
#define _EVENTOUT_PE9_ 1
#define _EVENTOUT_PH0_ 1
#define _EVENTOUT_PH1_ 1
#define _EVENTOUT_PH3_ 1

#define I2C1_SCL_PA9_ PA9,GPIO_AF4
#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PA9_ 1
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

