susanw1/zscript/receivers/native/arm/implementations/src/main/c++/stm32/AlternateFunction/STM32L45x.h
#define I2C1_SDA_PA10_ PA10,GPIO_AF4
#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PA10_ 1
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PA1_ PA1,GPIO_AF4
#define I2C1_SMBA_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF4
#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define _I2C1_SMBA_PA1_ 1
#define _I2C1_SMBA_PA14 (JTCK/SWCLK)_ 1
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PB10_ PB10,GPIO_AF4
#define I2C2_SCL_PB13_ PB13,GPIO_AF4
#define _I2C2_SCL_PB10_ 1
#define _I2C2_SCL_PB13_ 1

#define I2C2_SDA_PB11_ PB11,GPIO_AF4
#define I2C2_SDA_PB14_ PB14,GPIO_AF4
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PB14_ 1

#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define _I2C2_SMBA_PB12_ 1

#define I2C3_SCL_PA7_ PA7,GPIO_AF4
#define I2C3_SCL_PC0_ PC0,GPIO_AF4
#define _I2C3_SCL_PA7_ 1
#define _I2C3_SCL_PC0_ 1

#define I2C3_SDA_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF4
#define I2C3_SDA_PC1_ PC1,GPIO_AF4
#define _I2C3_SDA_PB4 (NJTRST)_ 1
#define _I2C3_SDA_PC1_ 1

#define I2C3_SMBA_PB2_ PB2,GPIO_AF4
#define _I2C3_SMBA_PB2_ 1

#define I2C4_SCL_PB10_ PB10,GPIO_AF3
#define I2C4_SCL_PB6_ PB6,GPIO_AF5
#define I2C4_SCL_PC0_ PC0,GPIO_AF2
#define I2C4_SCL_PD12_ PD12,GPIO_AF4
#define _I2C4_SCL_PB10_ 1
#define _I2C4_SCL_PB6_ 1
#define _I2C4_SCL_PC0_ 1
#define _I2C4_SCL_PD12_ 1

#define I2C4_SDA_PB11_ PB11,GPIO_AF3
#define I2C4_SDA_PB7_ PB7,GPIO_AF5
#define I2C4_SDA_PC1_ PC1,GPIO_AF2
#define I2C4_SDA_PD13_ PD13,GPIO_AF4
#define _I2C4_SDA_PB11_ 1
#define _I2C4_SDA_PB7_ 1
#define _I2C4_SDA_PC1_ 1
#define _I2C4_SDA_PD13_ 1

#define I2C4_SMBA_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF5
#define I2C4_SMBA_PD11_ PD11,GPIO_AF4
#define _I2C4_SMBA_PA14 (JTCK/SWCLK)_ 1
#define _I2C4_SMBA_PD11_ 1

#define IR_OUT_PA13 (JTMS/SWDIO)_ PA13 (JTMS/SWDIO),GPIO_AF1
#define IR_OUT_PB9_ PB9,GPIO_AF1
#define _IR_OUT_PA13 (JTMS/SWDIO)_ 1
#define _IR_OUT_PB9_ 1

#define LPTIM1_ETR_PB6_ PB6,GPIO_AF1
#define LPTIM1_ETR_PC3_ PC3,GPIO_AF1
#define _LPTIM1_ETR_PB6_ 1
#define _LPTIM1_ETR_PC3_ 1

#define LPTIM1_IN1_PB5_ PB5,GPIO_AF1
#define LPTIM1_IN1_PC0_ PC0,GPIO_AF1
#define _LPTIM1_IN1_PB5_ 1
#define _LPTIM1_IN1_PC0_ 1

#define LPTIM1_IN2_PB7_ PB7,GPIO_AF1
#define LPTIM1_IN2_PC2_ PC2,GPIO_AF1
#define _LPTIM1_IN2_PB7_ 1
#define _LPTIM1_IN2_PC2_ 1

#define LPTIM1_OUT_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF1
#define LPTIM1_OUT_PB2_ PB2,GPIO_AF1
#define LPTIM1_OUT_PC1_ PC1,GPIO_AF1
#define _LPTIM1_OUT_PA14 (JTCK/SWCLK)_ 1
#define _LPTIM1_OUT_PB2_ 1
#define _LPTIM1_OUT_PC1_ 1

#define LPTIM2_ETR_PA5_ PA5,GPIO_AF14
#define LPTIM2_ETR_PC3_ PC3,GPIO_AF14
#define LPTIM2_ETR_PD11_ PD11,GPIO_AF14
#define _LPTIM2_ETR_PA5_ 1
#define _LPTIM2_ETR_PC3_ 1
#define _LPTIM2_ETR_PD11_ 1

#define LPTIM2_IN1_PB1_ PB1,GPIO_AF14
#define LPTIM2_IN1_PC0_ PC0,GPIO_AF14
#define LPTIM2_IN1_PD12_ PD12,GPIO_AF14
#define _LPTIM2_IN1_PB1_ 1
#define _LPTIM2_IN1_PC0_ 1
#define _LPTIM2_IN1_PD12_ 1

#define LPTIM2_OUT_PA4_ PA4,GPIO_AF14
#define LPTIM2_OUT_PA8_ PA8,GPIO_AF14
#define LPTIM2_OUT_PD13_ PD13,GPIO_AF14
#define _LPTIM2_OUT_PA4_ 1
#define _LPTIM2_OUT_PA8_ 1
#define _LPTIM2_OUT_PD13_ 1

#define LPUART1_CTS_PA6_ PA6,GPIO_AF8
#define LPUART1_CTS_PB13_ PB13,GPIO_AF8
#define _LPUART1_CTS_PA6_ 1
#define _LPUART1_CTS_PB13_ 1

#define LPUART1_DE_PB1_ PB1,GPIO_AF8
#define LPUART1_DE_PB12_ PB12,GPIO_AF8
#define _LPUART1_DE_PB1_ 1
#define _LPUART1_DE_PB12_ 1

#define LPUART1_RTS_PB1_ PB1,GPIO_AF8
#define LPUART1_RTS_PB12_ PB12,GPIO_AF8
#define _LPUART1_RTS_PB1_ 1
#define _LPUART1_RTS_PB12_ 1

#define LPUART1_RX_PA3_ PA3,GPIO_AF8
#define LPUART1_RX_PB10_ PB10,GPIO_AF8
#define LPUART1_RX_PC0_ PC0,GPIO_AF8
#define _LPUART1_RX_PA3_ 1
#define _LPUART1_RX_PB10_ 1
#define _LPUART1_RX_PC0_ 1

#define LPUART1_TX_PA2_ PA2,GPIO_AF8
#define LPUART1_TX_PB11_ PB11,GPIO_AF8
#define LPUART1_TX_PC1_ PC1,GPIO_AF8
#define _LPUART1_TX_PA2_ 1
#define _LPUART1_TX_PB11_ 1
#define _LPUART1_TX_PC1_ 1

#define QUADSPI_BK1_IO0_PB1_ PB1,GPIO_AF10
#define QUADSPI_BK1_IO0_PE12_ PE12,GPIO_AF10
#define _QUADSPI_BK1_IO0_PB1_ 1
#define _QUADSPI_BK1_IO0_PE12_ 1

#define QUADSPI_BK1_IO1_PB0_ PB0,GPIO_AF10
#define QUADSPI_BK1_IO1_PE13_ PE13,GPIO_AF10
#define _QUADSPI_BK1_IO1_PB0_ 1
#define _QUADSPI_BK1_IO1_PE13_ 1

#define QUADSPI_BK1_IO2_PA7_ PA7,GPIO_AF10
#define QUADSPI_BK1_IO2_PE14_ PE14,GPIO_AF10
#define _QUADSPI_BK1_IO2_PA7_ 1
#define _QUADSPI_BK1_IO2_PE14_ 1

#define QUADSPI_BK1_IO3_PA6_ PA6,GPIO_AF10
#define QUADSPI_BK1_IO3_PE15_ PE15,GPIO_AF10
#define _QUADSPI_BK1_IO3_PA6_ 1
#define _QUADSPI_BK1_IO3_PE15_ 1

#define QUADSPI_BK1_NCS_PA2_ PA2,GPIO_AF10
#define QUADSPI_BK1_NCS_PB11_ PB11,GPIO_AF10
#define QUADSPI_BK1_NCS_PE11_ PE11,GPIO_AF10
#define _QUADSPI_BK1_NCS_PA2_ 1
#define _QUADSPI_BK1_NCS_PB11_ 1
#define _QUADSPI_BK1_NCS_PE11_ 1

#define QUADSPI_BK2_IO0_PD4_ PD4,GPIO_AF10
#define _QUADSPI_BK2_IO0_PD4_ 1

#define QUADSPI_BK2_IO1_PD5_ PD5,GPIO_AF10
#define _QUADSPI_BK2_IO1_PD5_ 1

#define QUADSPI_BK2_IO2_PD6_ PD6,GPIO_AF10
#define _QUADSPI_BK2_IO2_PD6_ 1

#define QUADSPI_BK2_IO3_PD7_ PD7,GPIO_AF10
#define _QUADSPI_BK2_IO3_PD7_ 1

#define QUADSPI_BK2_NCS_PD3_ PD3,GPIO_AF10
#define _QUADSPI_BK2_NCS_PD3_ 1

#define QUADSPI_CLK_PA3_ PA3,GPIO_AF10
#define QUADSPI_CLK_PB10_ PB10,GPIO_AF10
#define QUADSPI_CLK_PE10_ PE10,GPIO_AF10
#define _QUADSPI_CLK_PA3_ 1
#define _QUADSPI_CLK_PB10_ 1
#define _QUADSPI_CLK_PE10_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_PA8_ 1

#define RTC_OUT_ALARM_PB2_ PB2,GPIO_AF0
#define _RTC_OUT_ALARM_PB2_ 1

#define RTC_OUT_CALIB_PB2_ PB2,GPIO_AF0
#define _RTC_OUT_CALIB_PB2_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PB15_ 1

#define SAI1_EXTCLK_PA0_ PA0,GPIO_AF13
#define SAI1_EXTCLK_PB0_ PB0,GPIO_AF13
#define _SAI1_EXTCLK_PA0_ 1
#define _SAI1_EXTCLK_PB0_ 1

#define SAI1_FS_A_PA9_ PA9,GPIO_AF13
#define SAI1_FS_A_PB12_ PB12,GPIO_AF13
#define SAI1_FS_A_PB9_ PB9,GPIO_AF13
#define SAI1_FS_A_PE4_ PE4,GPIO_AF13
#define _SAI1_FS_A_PA9_ 1
#define _SAI1_FS_A_PB12_ 1
#define _SAI1_FS_A_PB9_ 1
#define _SAI1_FS_A_PE4_ 1

#define SAI1_FS_B_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF13
#define SAI1_FS_B_PA4_ PA4,GPIO_AF13
#define SAI1_FS_B_PB6_ PB6,GPIO_AF13
#define SAI1_FS_B_PE9_ PE9,GPIO_AF13
#define _SAI1_FS_B_PA14 (JTCK/SWCLK)_ 1
#define _SAI1_FS_B_PA4_ 1
#define _SAI1_FS_B_PB6_ 1
#define _SAI1_FS_B_PE9_ 1

#define SAI1_MCLK_A_PA3_ PA3,GPIO_AF13
#define SAI1_MCLK_A_PB14_ PB14,GPIO_AF13
#define SAI1_MCLK_A_PB8_ PB8,GPIO_AF13
#define SAI1_MCLK_A_PE2_ PE2,GPIO_AF13
#define _SAI1_MCLK_A_PA3_ 1
#define _SAI1_MCLK_A_PB14_ 1
#define _SAI1_MCLK_A_PB8_ 1
#define _SAI1_MCLK_A_PE2_ 1

#define SAI1_MCLK_B_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF13
#define SAI1_MCLK_B_PE10_ PE10,GPIO_AF13
#define _SAI1_MCLK_B_PB4 (NJTRST)_ 1
#define _SAI1_MCLK_B_PE10_ 1

#define SAI1_SCK_A_PA8_ PA8,GPIO_AF13
#define SAI1_SCK_A_PB10_ PB10,GPIO_AF13
#define SAI1_SCK_A_PB13_ PB13,GPIO_AF13
#define SAI1_SCK_A_PE5_ PE5,GPIO_AF13
#define _SAI1_SCK_A_PA8_ 1
#define _SAI1_SCK_A_PB10_ 1
#define _SAI1_SCK_A_PB13_ 1
#define _SAI1_SCK_A_PE5_ 1

