susanw1/zscript/receivers/native/arm/implementations/src/main/c++/stm32/AlternateFunction/STM32L45x.h
#define TIM1_BKIN_COMP2_PA6_ PA6,GPIO_AF12
#define TIM1_BKIN_COMP2_PB12_ PB12,GPIO_AF3
#define _TIM1_BKIN_COMP2_PA6_ 1
#define _TIM1_BKIN_COMP2_PB12_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF1
#define TIM1_CH1_PE9_ PE9,GPIO_AF1
#define _TIM1_CH1_PA8_ 1
#define _TIM1_CH1_PE9_ 1

#define TIM1_CH1N_PA7_ PA7,GPIO_AF1
#define TIM1_CH1N_PB13_ PB13,GPIO_AF1
#define TIM1_CH1N_PE8_ PE8,GPIO_AF1
#define _TIM1_CH1N_PA7_ 1
#define _TIM1_CH1N_PB13_ 1
#define _TIM1_CH1N_PE8_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF1
#define TIM1_CH2_PE11_ PE11,GPIO_AF1
#define _TIM1_CH2_PA9_ 1
#define _TIM1_CH2_PE11_ 1

#define TIM1_CH2N_PB0_ PB0,GPIO_AF1
#define TIM1_CH2N_PB14_ PB14,GPIO_AF1
#define TIM1_CH2N_PE10_ PE10,GPIO_AF1
#define _TIM1_CH2N_PB0_ 1
#define _TIM1_CH2N_PB14_ 1
#define _TIM1_CH2N_PE10_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF1
#define TIM1_CH3_PE13_ PE13,GPIO_AF1
#define _TIM1_CH3_PA10_ 1
#define _TIM1_CH3_PE13_ 1

#define TIM1_CH3N_PB1_ PB1,GPIO_AF1
#define TIM1_CH3N_PB15_ PB15,GPIO_AF1
#define TIM1_CH3N_PE12_ PE12,GPIO_AF1
#define _TIM1_CH3N_PB1_ 1
#define _TIM1_CH3N_PB15_ 1
#define _TIM1_CH3N_PE12_ 1

#define TIM1_CH4_PA11_ PA11,GPIO_AF1
#define TIM1_CH4_PE14_ PE14,GPIO_AF1
#define _TIM1_CH4_PA11_ 1
#define _TIM1_CH4_PE14_ 1

#define TIM1_ETR_PA12_ PA12,GPIO_AF1
#define TIM1_ETR_PE7_ PE7,GPIO_AF1
#define _TIM1_ETR_PA12_ 1
#define _TIM1_ETR_PE7_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF1
#define TIM2_CH1_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF1
#define TIM2_CH1_PA5_ PA5,GPIO_AF1
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15 (JTDI)_ 1
#define _TIM2_CH1_PA5_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF1
#define TIM2_CH2_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF1
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3 (JTDO/TRACESWO)_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF1
#define TIM2_CH3_PB10_ PB10,GPIO_AF1
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB10_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF1
#define TIM2_CH4_PB11_ PB11,GPIO_AF1
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF14
#define TIM2_ETR_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF2
#define TIM2_ETR_PA5_ PA5,GPIO_AF2
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15 (JTDI)_ 1
#define _TIM2_ETR_PA5_ 1

#define TIM3_CH1_PA6_ PA6,GPIO_AF2
#define TIM3_CH1_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF2
#define TIM3_CH1_PC6_ PC6,GPIO_AF2
#define TIM3_CH1_PE3_ PE3,GPIO_AF2
#define _TIM3_CH1_PA6_ 1
#define _TIM3_CH1_PB4 (NJTRST)_ 1
#define _TIM3_CH1_PC6_ 1
#define _TIM3_CH1_PE3_ 1

#define TIM3_CH2_PA7_ PA7,GPIO_AF2
#define TIM3_CH2_PB5_ PB5,GPIO_AF2
#define TIM3_CH2_PC7_ PC7,GPIO_AF2
#define TIM3_CH2_PE4_ PE4,GPIO_AF2
#define _TIM3_CH2_PA7_ 1
#define _TIM3_CH2_PB5_ 1
#define _TIM3_CH2_PC7_ 1
#define _TIM3_CH2_PE4_ 1

#define TIM3_CH3_PB0_ PB0,GPIO_AF2
#define TIM3_CH3_PC8_ PC8,GPIO_AF2
#define TIM3_CH3_PE5_ PE5,GPIO_AF2
#define _TIM3_CH3_PB0_ 1
#define _TIM3_CH3_PC8_ 1
#define _TIM3_CH3_PE5_ 1

#define TIM3_CH4_PB1_ PB1,GPIO_AF2
#define TIM3_CH4_PC9_ PC9,GPIO_AF2
#define TIM3_CH4_PE6_ PE6,GPIO_AF2
#define _TIM3_CH4_PB1_ 1
#define _TIM3_CH4_PC9_ 1
#define _TIM3_CH4_PE6_ 1

#define TIM3_ETR_PD2_ PD2,GPIO_AF2
#define TIM3_ETR_PE2_ PE2,GPIO_AF2
#define _TIM3_ETR_PD2_ 1
#define _TIM3_ETR_PE2_ 1

#define TSC_G1_IO1_PB12_ PB12,GPIO_AF9
#define _TSC_G1_IO1_PB12_ 1

#define TSC_G1_IO2_PB13_ PB13,GPIO_AF9
#define _TSC_G1_IO2_PB13_ 1

#define TSC_G1_IO3_PB14_ PB14,GPIO_AF9
#define _TSC_G1_IO3_PB14_ 1

#define TSC_G1_IO4_PB15_ PB15,GPIO_AF9
#define _TSC_G1_IO4_PB15_ 1

#define TSC_G2_IO1_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF9
#define _TSC_G2_IO1_PB4 (NJTRST)_ 1

#define TSC_G2_IO2_PB5_ PB5,GPIO_AF9
#define _TSC_G2_IO2_PB5_ 1

#define TSC_G2_IO3_PB6_ PB6,GPIO_AF9
#define _TSC_G2_IO3_PB6_ 1

#define TSC_G2_IO4_PB7_ PB7,GPIO_AF9
#define _TSC_G2_IO4_PB7_ 1

#define TSC_G3_IO1_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF9
#define _TSC_G3_IO1_PA15 (JTDI)_ 1

#define TSC_G3_IO2_PC10_ PC10,GPIO_AF9
#define _TSC_G3_IO2_PC10_ 1

#define TSC_G3_IO3_PC11_ PC11,GPIO_AF9
#define _TSC_G3_IO3_PC11_ 1

#define TSC_G3_IO4_PC12_ PC12,GPIO_AF9
#define _TSC_G3_IO4_PC12_ 1

#define TSC_G4_IO1_PC6_ PC6,GPIO_AF9
#define _TSC_G4_IO1_PC6_ 1

#define TSC_G4_IO2_PC7_ PC7,GPIO_AF9
#define _TSC_G4_IO2_PC7_ 1

#define TSC_G4_IO3_PC8_ PC8,GPIO_AF9
#define _TSC_G4_IO3_PC8_ 1

#define TSC_G4_IO4_PC9_ PC9,GPIO_AF9
#define _TSC_G4_IO4_PC9_ 1

#define TSC_G5_IO1_PE10_ PE10,GPIO_AF9
#define _TSC_G5_IO1_PE10_ 1

#define TSC_G5_IO2_PE11_ PE11,GPIO_AF9
#define _TSC_G5_IO2_PE11_ 1

#define TSC_G5_IO3_PE12_ PE12,GPIO_AF9
#define _TSC_G5_IO3_PE12_ 1

#define TSC_G5_IO4_PE13_ PE13,GPIO_AF9
#define _TSC_G5_IO4_PE13_ 1

#define TSC_G6_IO1_PD10_ PD10,GPIO_AF9
#define _TSC_G6_IO1_PD10_ 1

#define TSC_G6_IO2_PD11_ PD11,GPIO_AF9
#define _TSC_G6_IO2_PD11_ 1

#define TSC_G6_IO3_PD12_ PD12,GPIO_AF9
#define _TSC_G6_IO3_PD12_ 1

#define TSC_G6_IO4_PD13_ PD13,GPIO_AF9
#define _TSC_G6_IO4_PD13_ 1

#define TSC_G7_IO1_PE2_ PE2,GPIO_AF9
#define _TSC_G7_IO1_PE2_ 1

#define TSC_G7_IO2_PE3_ PE3,GPIO_AF9
#define _TSC_G7_IO2_PE3_ 1

#define TSC_G7_IO3_PE4_ PE4,GPIO_AF9
#define _TSC_G7_IO3_PE4_ 1

#define TSC_G7_IO4_PE5_ PE5,GPIO_AF9
#define _TSC_G7_IO4_PE5_ 1

#define TSC_SYNC_PB10_ PB10,GPIO_AF9
#define TSC_SYNC_PD2_ PD2,GPIO_AF9
#define _TSC_SYNC_PB10_ 1
#define _TSC_SYNC_PD2_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF7
#define UART1_CK_PB5_ PB5,GPIO_AF7
#define _UART1_CK_PA8_ 1
#define _UART1_CK_PB5_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define UART1_CTS_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF7
#define _UART1_CTS_PA11_ 1
#define _UART1_CTS_PB4 (NJTRST)_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF7
#define UART1_DE_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF7
#define _UART1_DE_PA12_ 1
#define _UART1_DE_PB3 (JTDO/TRACESWO)_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF7
#define UART1_RTS_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF7
#define _UART1_RTS_PA12_ 1
#define _UART1_RTS_PB3 (JTDO/TRACESWO)_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF7
#define UART1_RX_PB7_ PB7,GPIO_AF7
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB7_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF7
#define UART1_TX_PB6_ PB6,GPIO_AF7
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1

#define UART2_CK_PA4_ PA4,GPIO_AF7
#define UART2_CK_PD7_ PD7,GPIO_AF7
#define _UART2_CK_PA4_ 1
#define _UART2_CK_PD7_ 1

